[
  {
    "title": "Cisco Nexus One Fabric: Unify Data Center Operations with Open VXLAN/EVPN Standards",
    "date": "November 19, 2025",
    "link": "https://blogs.cisco.com/datacenter/cisco-nexus-one-fabric-unify-data-center-operations-with-open-vxlan-evpn-standards",
    "description": "Ignite a new era of data center agility with Cisco Nexus One Fabric solution—where open standards meet powerful innovation. See how you can simplify your network operations, boost security, and get ahead of the curve with the future of unified fabric technology."
  },
  {
    "title": "Demystifying Network as Code and Services as Code",
    "date": "November 19, 2025",
    "link": "https://blogs.cisco.com/customerexperience/demystifying-network-as-code-and-services-as-code",
    "description": "Demystify Network as Code and Cisco Services as Code. Explore the evolution of network automation, declarative principles, and how Cisco's comprehensive, AI-integrated solutions bring efficiency and quality to network management."
  },
  {
    "title": "How Cisco’s Time2Give Connects Careers, Global Strategy, and Local Impact",
    "date": "November 19, 2025",
    "link": "https://blogs.cisco.com/wearecisco/how-ciscos-time2give-connects-careers-global-strategy-and-local-impact",
    "description": "Marley P., Supply Chain Sustainability Specialist, and her team got muddy boots and built connections with Time2Give, linking global strategy to local impact."
  },
  {
    "title": "Cisco + BlueCat: Unified Branch for Smarter, Simpler Networking",
    "date": "November 18, 2025",
    "link": "https://blogs.cisco.com/partner/cisco-bluecat-unified-branch-for-smarter-simpler-networking",
    "description": "Cisco Unified Branch and BlueCat Micetro unify networking, security, and DDI automation for consistent, AI-ready branch operations."
  },
  {
    "title": "The Peloton Approach to CCNA Exam Success",
    "date": "November 18, 2025",
    "link": "https://blogs.cisco.com/learning/the-peloton-approach-to-ccna-exam-success",
    "description": "Quit the \"Almost There\" Club and cross the CCNA finish line with the help of AI."
  },
  {
    "title": "Simplifying Conference Room Deployments with Catalyst 9200CX",
    "date": "November 18, 2025",
    "link": "https://blogs.cisco.com/networking/simplifying-conference-room-deployments-with-catalyst-9200cx",
    "description": "The Cisco Catalyst 9200CX streamlines conference room setup by unifying AVoIP, networking, and Webex for secure, scalable hybrid collaboration."
  },
  {
    "title": "From Stretched to Strategic: Cisco Cloud Networking for Lean IT Teams",
    "date": "November 18, 2025",
    "link": "https://blogs.cisco.com/smb/from-stretched-to-strategic-cisco-cloud-networking-for-lean-it-teams",
    "description": "Discover how Cisco Cloud Networking transforms network management for lean SMB IT teams, offering unparalleled simplicity, centralized control, AI assistance, and integrated security to overcome daily challenges and drive strategic growth."
  },
  {
    "title": "Identity-Driven Firewalls: Shaping the Future of Adaptive Security",
    "date": "November 18, 2025",
    "link": "https://blogs.cisco.com/security/identity-driven-firewalls-shaping-the-future-of-adaptive-security",
    "description": "Active Directory compromises, credential theft, lateral movement. See how identity-driven security policies stop breaches before attackers escalate privileges."
  },
  {
    "title": "Introducing our FY25 Cisco Foundation Impact Report",
    "date": "November 18, 2025",
    "link": "https://blogs.cisco.com/our-corporate-purpose/introducing-our-fy25-cisco-foundation-impact-report",
    "description": "Since 1997, the Cisco Foundation has positively impacted more than one billion lives, delivered millions in catalytic funding, and reached organizations in nearly every region of the world. Today, we’re proud to report our latest impact and progress in our FY25 Cisco Foundation Impact Report."
  }
]