[
  {
    "title": "IBM and University of Dayton Announce Joint Research Collaboration for Next-Generation Semiconductor Technologies",
    "date": "November 19, 2025",
    "link": "https://newsroom.ibm.com/2025-11-19-ibm-and-university-of-dayton-announce-joint-research-collaboration-for-next-generation-semiconductor-technologies",
    "description": "IBM (NYSE: IBM) and the University of Dayton today announced an agreement for the joint research and development of next-generation semiconductor technologies and materials. The collaboration aims to advance critical technologies for the age of AI including AI hardware, advanced packaging, and photonics."
  },
  {
    "title": "IBM named a Leader  in 2025 Gartner® Magic Quadrant™ for Finance Transformation Strategy Consulting",
    "date": "November 19, 2025",
    "link": "https://newsroom.ibm.com/blog-ibm-named-a-leader-in-2025-gartner-magic-quadrant-TM-for-finance-transformation-strategy-consulting",
    "description": "We are thrilled to share that IBM has been recognized as a Leader in the 2025 Gartner Magic Quadrant for Finance Transformation Strategy Consulting (FTSC) In our opinion, this recognition reflects..."
  },
  {
    "title": "Atruvia and IBM Sign Long-Term Agreement to Future-Proof IT Platforms for Autonomous and Sustainable Banking",
    "date": "November 19, 2025",
    "link": "https://newsroom.ibm.com/2025-11-19-atruvia-and-ibm-sign-long-term-agreement-to-future-proof-it-platforms-for-autonomous-and-sustainable-banking",
    "description": "Atruvia AG, the digitalization partner of the German Cooperative Financial Group, and IBM (NYSE: IBM) have sealed a long-term collaboration that paves the way for sustainable and state-of-the-art IT platforms for the banking of tomorrow."
  },
  {
    "title": "IBM Storage Scale 6000: Powering the AI Factory by Eliminating Data Silos and Delivering Breakthrough Performance",
    "date": "November 18, 2025",
    "link": "https://newsroom.ibm.com/blog-ibm-storage-scale-6000-powering-the-ai-factory-by-eliminating-data-silos-and-delivering-breakthrough-performance",
    "description": "An AI factory without data is like an engine without fuel; it simply can’t run. IBM Storage Scale System 6000 solves this by unifying data across edge, core, and cloud through its global..."
  },
  {
    "title": "IBM Consulting Advantage Integrates with Microsoft Copilot to Drive Smarter, Faster Workflows with Enterprise AI",
    "date": "November 18, 2025",
    "link": "https://newsroom.ibm.com/blog-ibm-consulting-advantage-integrates-with-microsoft-copilot-to-drive-smarter,-faster-workflows-with-enterprise-ai",
    "description": "At the beginning of the year, I shared my belief that successful AI adoption depends on making AI easy to use within the processes and tools employees rely on every day. Today, I’m pleased to..."
  },
  {
    "title": "Unanimous Decision: UFC and IBM Introduce New AI-Driven In-Fight Insights",
    "date": "November 14, 2025",
    "link": "https://newsroom.ibm.com/ufc-and-ibm-introduce-ai-driven-in-fight-insights",
    "description": "IBM (NYSE: IBM) and UFC, the world's premier mixed martial arts organization, today announced the next phase of their technological evolution with the launch of In-Fight Insights, an AI-driven live alert platform that monitors and reports in real time when notable milestones, streaks and records occur during UFC events. It is slated to debut at UFC® 322: DELLA MADDALENA vs. MAKHACHEV, which takes place at New York's Madison Square Garden this Saturday, November 15."
  },
  {
    "title": "IBM Study: Chief Data Officers Redefine Strategies as AI Ambitions Outpace Readiness",
    "date": "November 13, 2025",
    "link": "https://newsroom.ibm.com/2025-11-13-IBM-Study-Chief-Data-Officers-Redefine-Strategies-as-AI-Ambitions-Outpace-Readiness",
    "description": "A new global study by the IBM (NYSE: IBM) Institute for Business Value reveals enterprise data strategies are rapidly evolving as organizations race to scale AI across their business. The findings suggest that while Chief Data Officers (CDOs) are at the helm of this transformation, many say their data is still not ready to unlock AI's full potential."
  },
  {
    "title": "IBM Delivers New Quantum Processors, Software, and Algorithm Breakthroughs on Path to Advantage and Fault Tolerance",
    "date": "November 12, 2025",
    "link": "https://newsroom.ibm.com/2025-11-12-ibm-delivers-new-quantum-processors,-software,-and-algorithm-breakthroughs-on-path-to-advantage-and-fault-tolerance",
    "description": "At the annual Quantum Developer Conference, IBM (NYSE: IBM) today unveiled fundamental progress on its path to delivering both quantum advantage by the end of 2026 and fault-tolerant quantum computing by 2029."
  },
  {
    "title": "Unipol Assicurazioni Leverages IBM watsonx to Build a New AI-driven Automation Platform",
    "date": "November 11, 2025",
    "link": "https://newsroom.ibm.com/2025-11-11-Unipol-Assicurazioni-Leverages-IBM-watsonx-to-Build-a-New-AI-driven-Automation-Platform",
    "description": "IBM and Unipol Assicurazioni, one of Europe’s largest insurance groups and leader in Italy in the non-life sector, are renewing their collaboration to continue the Company's digital transformation journey they embarked on over a year ago. This journey, starting with the adoption of hybrid cloud by design, is evolving towards strengthening the IT infrastructure with the new z17 technology and expanding AI capabilities directly onto production mainframe data."
  },
  {
    "title": "IBM and Web Summit to Launch Sports Tech Startup Challenge to Fuel Next Wave of Innovation in Sports",
    "date": "November 10, 2025",
    "link": "https://newsroom.ibm.com/ibm-x-web-summit-sports-tech-startup-challenge",
    "description": "IBM (NYSE: IBM) and Web Summit today unveiled a new global sports-tech competition proposal. The Sports Tech Startup Challenge will spotlight startups using AI to revolutionize sports — from athlete performance and stadium operations to fan engagement — with regional events planned for Qatar, Vancouver, and Rio, culminating with global winners being selected during Web Summit Lisbon 2026. Participation will be subject to local laws and official rules to be published before each regional competition."
  }
]